{
  "stones": [
    {
      "id": "granite",
      "name": "гранит",
      "class": "basic",
      "image": "src/images/granite.jpg",
      "description": "Плотный и зернистый камень с характерным крапчатым рисунком. Образуется глубоко в земной коре и ценится за устойчивость и надёжность. Даёт ровное, долгое охлаждение и почти не впитывает запахи."
    },
    {
      "id": "basalt",
      "name": "базальт",
      "class": "basic",
      "description": "Тёмный вулканический камень с гладкой, слегка матовой поверхностью. Возникает при застывании лавы, поэтому отличается высокой плотностью и теплоёмкостью. Охлаждает мягко и стабильно, без резкого перепада температуры."
    },
    {
      "id": "river",
      "name": "речной камень",
      "class": "basic",
      "description": "Окатанный водой камень с естественной, слегка неровной формой. Его поверхность шлифуется течением годами, поэтому он приятно лежит в руке. Даёт деликатное охлаждение и хорошо подходит для неспешных напитков."
    },
    {
      "id": "marble",
      "name": "мрамор",
      "class": "medium",
      "description": "Светлый камень с мягкими прожилками и гладкой полированной поверхностью. Образуется из известняка под давлением и температурой. Быстро отдаёт холод и создаёт ощущение свежести в напитке."
    },
    {
      "id": "slate",
      "name": "сланец",
      "class": "medium",
      "description": "Тонкослойный камень с графичной текстурой и сдержанным цветом. Формируется из осадочных пород и легко расщепляется на пластины. Даёт умеренное охлаждение и подчёркивает чистоту вкуса."
    },
    {
      "id": "quartz",
      "name": "кварц",
      "class": "medium",
      "description": "Прозрачный или полупрозрачный камень с чистыми линиями и стеклянным блеском. Один из самых распространённых минералов в земной коре. Хорошо держит температуру и остаётся нейтральным к вкусу напитка."
    },
    {
      "id": "obsidian",
      "name": "обсидиан",
      "class": "accent",
      "description": "Гладкий чёрный камень с глянцевой поверхностью, напоминающей стекло. Это застывшая вулканическая лава, не успевшая кристаллизоваться. Даёт быстрый холод и заметный температурный акцент."
    },
    {
      "id": "nephrite",
      "name": "нефрит",
      "class": "accent",
      "description": "Плотный камень с глубокой зелёной окраской и шелковистой поверхностью. Известен своей прочностью и однородной структурой. Обеспечивает мягкое, длительное охлаждение и ощущение стабильности."
    },
    {
      "id": "jasper",
      "name": "яшма",
      "class": "accent",
      "description": "Камень с богатой цветовой палитрой и природным рисунком. Относится к разновидностям кварца и формируется в сложных геологических условиях. Хорошо удерживает холод и добавляет визуальный акцент напитку."
    }
  ],

  "stoneClasses": [
    {
      "id": "basic",
      "name": "базовые",
      "price": 10,
      "description": "Простые природные камни спокойных оттенков, найденные в реках и распространённых породах."
    },
    {
      "id": "medium",
      "name": "средние",
      "price": 12,
      "description": "Камни с выраженной текстурой и рисунком, добытые из определённых слоёв породы и отобранные вручную."
    },
    {
      "id": "accent",
      "name": "акцентные",
      "price": 14,
      "description": "Выразительные камни с ярким цветом и узором, добываемые в конкретных местах и требующие аккуратной обработки."
    }
  ],

  "drinks": [
    {
      "id": "whisky",
      "name": "виски / бурбон",
      "recommendation": {
        "goal": "мягкое, долгое охлаждение без резкого удара",
        "stones": ["basalt", "granite", "nephrite"]
      }
    },
    {
      "id": "gin",
      "name": "джин",
      "recommendation": {
        "goal": "быстро охладить, сохранить свежесть",
        "stones": ["marble", "slate", "obsidian"]
      }
    },
    {
      "id": "rum",
      "name": "ром",
      "recommendation": {
        "goal": "баланс — не перегреть, не «убить» сладость",
        "stones": ["granite", "basalt", "jasper"]
      }
    },
    {
      "id": "vermouth",
      "name": "вермут",
      "recommendation": {
        "goal": "деликатное охлаждение, аромат важнее холода",
        "stones": ["river", "slate", "jasper"]
      }
    },
    {
      "id": "brandy",
      "name": "коньяк / бренди",
      "recommendation": {
        "goal": "минимальное вмешательство, часто пьют без охлаждения",
        "stones": ["river", "nephrite"]
      }
    },
    {
      "id": "vodka",
      "name": "водка",
      "recommendation": {
        "goal": "холод без сантиментов",
        "stones": ["marble", "quartz", "obsidian"]
      }
    }
  ]
}
